Element id of text associated with legend heading.
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public ElementId HeadingTextTypeId { get; set; }
  Visual Basic
Public Property HeadingTextTypeId As ElementId
	Get
	Set
  Visual C++
public:
property ElementId^ HeadingTextTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentNullException   |   When setting this property: A non-optional argument was NULL
 See Also
  AnalysisDisplayLegendSettings Class
  Autodesk.Revit.DB.Analysis Namespace